In [1]:
import pandas as pd 
import numpy as np

In [7]:
cars=pd.read_csv('Toyoto_Corrola.csv')
cars.head()

,Id,Model,Price,Age_08_04,KM,HP,Doors,Cylinders,Gears,Weight
0,1,TOYOTA Corolla 2.0 D4D HATCHB TERRA 2/3-Doors,13500,23,46986,90,3,4,5,1165
1,2,TOYOTA Corolla 2.0 D4D HATCHB TERRA 2/3-Doors,13750,23,72937,90,3,4,5,1165
2,3,ÊTOYOTA Corolla 2.0 D4D HATCHB TERRA 2/3-Doors,13950,24,41711,90,3,4,5,1165
3,4,TOYOTA Corolla 2.0 D4D HATCHB TERRA 2/3-Doors,14950,26,48000,90,3,4,5,1165
4,5,TOYOTA Corolla 2.0 D4D HATCHB SOL 2/3-Doors,13750,30,38500,90,3,4,5,1170

In [8]:
cars.duplicated().sum()

0

In [9]:
cars.shape

(1436, 10)

In [10]:
cars.isna().sum()

Id           0
Model        0
Price        0
Age_08_04    0
KM           0
HP           0
Doors        0
Cylinders    0
Gears        0
Weight       0
dtype: int64

In [11]:
cars['Gears'].value_counts()

5    1390
6      43
3       2
4       1
Name: Gears, dtype: int64

In [20]:
cars1=cars.drop(columns=["Id","Model","Cylinders","Doors","Gears"])
cars1.head()

   Price  Age_08_04     KM  HP  Weight
0  13500         23  46986  90    1165
1  13750         23  72937  90    1165
2  13950         24  41711  90    1165
3  14950         26  48000  90    1165
4  13750         30  38500  90    1170

In [21]:
cars1.rename(columns={'Age_08_04':'Age'},inplace=True)
cars1.head()

   Price  Age     KM  HP  Weight
0  13500   23  46986  90    1165
1  13750   23  72937  90    1165
2  13950   24  41711  90    1165
3  14950   26  48000  90    1165
4  13750   30  38500  90    1170

In [22]:
cars1.corr()

           Price       Age        KM        HP    Weight
Price   1.000000 -0.876590 -0.569960  0.314990  0.581198
Age    -0.876590  1.000000  0.505672 -0.156622 -0.470253
KM     -0.569960  0.505672  1.000000 -0.333538 -0.028598
HP      0.314990 -0.156622 -0.333538  1.000000  0.089614
Weight  0.581198 -0.470253 -0.028598  0.089614  1.000000